[
  {
    "img": {},
    "role": "Cheerleading Coach",
    "name": "Maddy Theobald",
    "text": [
      "Maddy has been involved in the sport of cheerleading for over 14 years. Starting at a local cheerleading club in Bendigo, Maddy was involved in both recreational and competitive cheer which later lead to coaching teams of her own. In 2015, Maddy made the move to Melbourne where she joined her team SCC Lady Reign. She competes in the International Open All Girl level 5 division. Lady Reign have competed at the Cheerleading World Championships three times, placing 7th in 2017, 5th in 2019, and more recently, winning the World Championships in 2021. Maddy has been recognised for her performance on the cheerleading floor, winning “outstanding performer” in 2018 and 2019. Maddy loves watching her athletes gain new skills, build confidence and push themselves to their full potential. Outside of cheer, Maddy works as the Manager and group fitness instructor at Snap Fitness Epsom."
    ]
  },
  {
    "img": {},
    "role": "Premier and Novice Pom Coach",
    "name": "Lauren Lourdes",
    "text": [
      "Lauren Lourdes has been teaching dance for over 15 years. She is trained in Jazz, Ballet, Tap and Pom. She started her professional career at the age of 14 and has had the opportunity to work in London, Hong Kong, Macau, New Zealand, and all over Australia. Her career highlights include dancing for Australia's Hugh Jackman, completing a 7-month contract for P&O Cruise Ships and working as a full-time dancer for the prestigious Venetian and Sands Casinos in Macau.",
      "In 2013 Lauren joined the All Star Dance world with Pride Dance Team. She has proudly competed at the famous Dance World Championships in Florida, twice for Jazz and Pom in both 2013 and 2016. Her team was the very first Australian team to bring home a medal for Pom, finishing 2nd in Open Co-ed Pom. Since then, Lauren has been coaching and competing in the All Star world, bringing home National Championships as both an athlete and a coach."
    ]
  },
  {
    "img": {},
    "role": "Open Pom and Hip-hop Coach",
    "name": "Abbey Armstrong",
    "text": [
      "Abbey Armstrong is a dedicated coach and passionate dancer who has performed both nationally and internationally, and has won State and National titles as a dancer and coach in the All Star world. Abbey's performance credits include: The Australian Open, Melbourne Aces Cheerleading Team, Ultimate Superbowl Event and the TV Week Logie Awards. Abbey has proudly competed at the Dance Worlds Championships in the Open Pom division with Pure Allstars in 2017. Outside of MUCD, Abbey is the owner of DU Studios, a qualified teacher and APPI certified Mat and Reformer Pilates instructor."
    ]
  },
  {
    "img": {},
    "role": "Jazz and Lyrical Coach",
    "name": "Sabrina Smith",
    "text": [
      "Sabrina has been dancing since the age of four, training in ballet, jazz, tap, and contemporary/lyrical. She grew up competing in Eisteddfod's and has won awards both as a competitor and choreographer.",
      "Some of her highlights include being invited to perform her contemporary solo at Top Class, a select showcase of the choreography of the top VCE dance students as well as performing as a dancer in State School Spectacular and dancing the leads of Mirliton, Spanish and Godmother Sylvie in a production of the Nutcracker.",
      "Sabrina has been teaching for 6 years and began Pom with MUCD in her second year of university. She is really looking forward to coaching the lyrical and jazz team this year."
    ]
  }
]
