[
  {
    "img": {},
    "role": "Club President",
    "name": "Megan Allis",
    "text": [
      "Hi! I'm Megan and I'm so excited to be your 2022 MUCD President! I'm in my fourth year studying a Bachelor of Arts in International Relations and a Diploma of Languages in Italian. I first joined the club in 2019 starting off with pom and have since also joined the hip-hop and cheer team, making this my fourth year here. MUCD has become my second home and from not knowing anyone in my first year, I have made lifelong friends over my time in the club. From trainings, competitions, workshops, parties and ball, I'm so excited for this year and can't wait to show everyone what an amazing club we have! I'm so honoured to be leading us all into what I know will be an amazing 2022!"
    ]
  },
  {
    "img": {},
    "role": "Vice President",
    "name": "Selimah Cua",
    "text": [
      "Hey guys! I'm Selimah, your 2022 VP! I'm currently working towards a Bachelor of Commerce majoring in Accounting and Marketing, and this will be my third year with MUCD! I first joined the hip-hop team in 2022 right before lockdown began, and although my first year with the club was spent on Zoom, it was truly the one thing that kept me going during lockdown. In 2021, I decided to try something know and joined pom too! It's been so fun being with the club, and I hope 2022 will be an amazing year."
    ]
  },
  {
    "img": {},
    "role": "Secretary",
    "name": "Ava Wansbrough",
    "text": [
      "I'm Ava, secretary of the MUCD committee! This is my third year on the cheer team and second year on the committee, and I've loved every second of it. Being a part of this club has changed my life, the community's support has helped me through my toughest times, and the passion of all the amazing athletes has inspired me to really push myself on my team and in my broader life. I'm so excited for another year of incredible teamwork, dedication and fun, making this club as great as it can be!"
    ]
  },
  {
    "img": {},
    "role": "Treasurer",
    "name": "Fiona Tran",
    "text": [
      "Hey guys! I'm Fiona, excited to be your treasurer again for 2022! This will be my 2nd year on the committee and 5th year with the club. I started my MUCD journey in 2018 on the cheer team and since 2020 I've been dancing with our open jazz and lyrical teams as well. During this time, I've graduated from a Bachelor of Biomedicine (Human Structure and Function) and currently I'm studying a Doctor of Optometry. I'm so honoured and grateful to be part of this amazing club, having so many wonderful memories, getting to travel around the country and make lifelong friends along the way. I'm so excited to see what MUCD 2022 brings and making this year our best one yet!"
    ]
  },
  {
    "img": {},
    "role": "Communications Officer",
    "name": "Sarah Carrington",
    "text": [
      "Hi everyone! I'm Sarah and I'll be your Communications Officer for 2022. I'm studying a Bachelor of Science majoring in Marine Biology and this is my second year at the club. I can definitely say that deciding to join MUCD was one of my best decisions! At MUCD, I've grown as a dancer and meet amazing people. The friends I've made through the club and the family-like community that MUCD is has made my first year of university amazing. With the dedicated coaches and all the fun events and competitions we have planned, I know 2022 will be an amazing year and I cannot wait."
    ]
  }
]
